# -*- eval: (save-excursion (org-babel-goto-named-src-block "workshopPreamble") (org-babel-execute-src-block)) -*-
#+TITLE:     Introduction to Categorical Data Anlaysis in R
#+AUTHOR:    Ista Zahn 
#+EMAIL:     dataclass@help.hmdc.harvard.edu
#+DATE:      


# NOTE: refer to the README file if you are unfamiliar with emacs or orgmode.

# Customize the PROPERTY and EXCLUDE_TAGS below depending on the type
# of export (see the README file for details). After setting the exports 
# property and/or the EXCLUDE_TAGS, place the curser on the poperty line 
# and press C-c C-c

#+PROPERTY: exports code
#+EXCLUDE_TAGS: noexport setup mitsetup


#+SETUPFILE: ../workshopPreamble.org

#+name: setupR
#+begin_src R :exports none :tangle no :results silent
  rm(list=ls())
  .First <- function() {
    options(width=70)
    options(useFancyQuotes=FALSE)
    options(show.signif.stars=FALSE)
    library(vcd)
    library(vcdExtra)
    library(MASS)
    library(gmodels)
  }
#+end_src

#+name: workshopPreamble
#+begin_src emacs-lisp :exports none :results silent :tangle no
  (set (make-local-variable 'org-confirm-babel-evaluate) nil)
  (load-file "../setupEnvironment.el")
#+end_src

** R packages

There are several R packages that make it easier to work with categorical data. Let's start by loading several of them.

#+BEGIN_SRC R
  library(vcd)
  library(vcdExtra)
  library(MASS)
#+END_SRC

#+RESULTS:
#+begin_example
> library(vcd)
> library(vcdExtra)
> library(MASS)
> 
#+end_example

** Converting from one representation to another
Convert from case from to table from using =table()=:
#+BEGIN_SRC R
  (arth.tab <- table(Arthritis[c("Improved")]))
#+END_SRC

#+RESULTS:
#+begin_example
> (arth.tab <- table(Arthritis[c("Improved")]))

  None   Some Marked 
    42     14     28 
> 
#+end_example

Convert from table to frequency form using  =as.data.frame()=
#+BEGIN_SRC R
  as.data.frame(arth.tab)
#+END_SRC

#+RESULTS:
#+begin_example
> as.data.frame(arth.tab)
    Var1 Freq
1   None   42
2   Some   14
3 Marked   28
> 
#+end_example

Convert from frequency or table form to case form using =expand.dft()=
#+BEGIN_SRC R
  head(expand.dft(table(Arthritis[c("Treatment", "Improved")])))
#+END_SRC

#+RESULTS:
#+begin_example
> head(expand.dft(table(Arthritis[c("Treatment", "Improved")])))
  Treatment Improved
1   Placebo     None
2   Placebo     None
3   Placebo     None
4   Placebo     None
5   Placebo     None
6   Placebo     None
> 
#+end_example

See also =?ftable= and =?structable=

** Indepence of two factors
The =chisq.test()= function can be used to test the independence of two-way tables.
#+BEGIN_SRC R
  chisq.test(table(Arthritis[c("Treatment", "Improved")]))
#+END_SRC

#+RESULTS:
#+begin_example
> chisq.test(table(Arthritis[c("Treatment", "Improved")]))

	Pearson's Chi-squared test

data:  table(Arthritis[c("Treatment", "Improved")])
X-squared = 13.055, df = 2, p-value = 0.001463

> 
#+end_example

Alternatively, the =fisher.test()= function can be used to calculate an exact test of independence.
#+BEGIN_SRC R
  fisher.test(table(Arthritis[c("Treatment", "Improved")]))
#+END_SRC

#+RESULTS:
#+begin_example
> fisher.test(table(Arthritis[c("Treatment", "Improved")]))

	Fisher's Exact Test for Count Data

data:  table(Arthritis[c("Treatment", "Improved")])
p-value = 0.001393
alternative hypothesis: two.sided

> 
#+end_example

** Testing independence when there are more than two factors of interest
The =mantelhaen.test()= function can be used to test the indepence of two factors within each level of a third factor. 

#+BEGIN_SRC R
  mantelhaen.test(table(Arthritis[c("Treatment", "Improved", "Sex")]))
#+END_SRC

#+RESULTS:
#+begin_example
> mantelhaen.test(table(Arthritis[c("Treatment", "Improved", "Sex")]))

	Cochran-Mantel-Haenszel test

data:  table(Arthritis[c("Treatment", "Improved", "Sex")])
Cochran-Mantel-Haenszel M^2 = 14.6323, df = 2, p-value =
0.0006647

> 
#+end_example

** Loglinear models

The =loglm()= function (in the =MASS= package) can be used to test indepence in multi-dimensional tables.

#+BEGIN_SRC R
  loglm(~ Improved + Treatment + Sex,
        data = table(Arthritis[c("Treatment", "Improved", "Sex")]))
#+END_SRC

#+RESULTS:
#+begin_example
> loglm(~ Improved + Treatment + Sex,
+       data = table(Arthritis[c("Treatment", "Improved", "Sex")]))
Call:
loglm(formula = ~Improved + Treatment + Sex, data = table(Arthritis[c("Treatment", 
    "Improved", "Sex")]))

Statistics:
                      X^2 df    P(> X^2)
Likelihood Ratio 23.33609  7 0.001489367
Pearson          19.60017  7 0.006501257
> 
#+end_example

** Mosaic plots

The =mosaic()= function can be used to plot tables or loglm models.

#+BEGIN_SRC R
  mosaic(table(Arthritis[c("Treatment", "Improved")]), gp = shading_max)
#+END_SRC

#+RESULTS:
#+begin_example
> mosaic(table(Arthritis[c("Treatment", "Improved")]), gp = shading_max)
> 
#+end_example


#+BEGIN_SRC R
  mosaic(loglm(~ Improved + Treatment + Sex,
        data = table(Arthritis[c("Treatment", "Improved", "Sex")])))
#+END_SRC


